app/views/assets/_form.html.erb

SELECT "products".* FROM "products"
---
    <%= f.label :category %><br />
	<%= collection_select(:product, :product_id, Product.all, :id, :name) %>