app/controllers/pages_controller.rb

  def product

    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1