app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
SELECT "colors".* FROM "colors" WHERE ("colors".product_id = 1)
---
  def edit

    @product = Product.find(params[:id])
    @colors = Color.find_all_by_product_id(@product['id'])

INSERT INTO "products" ("name", "code", "listPrice", "price", "costPrice", "is_active", "is_promo", "is_new", "sizes", "sizeType", "description", "composition", "sizeBust", "sizeSleeve", "sizeWaist", "sizeHip", "sizeThigh", "sizeInseam", "category_id", "created_at", "updated_at") VALUES ('calça', 'eun123', NULL, 99.0, NULL, 't', 'f', 'f', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-02-21 04:20:05.211494', '2011-02-21 04:20:05.211494') RETURNING "id"
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
UPDATE "products" SET "sizes" = '42,44,46,48,50', "updated_at" = '2011-02-25 02:28:44.957571' WHERE "products"."id" = 3
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])