app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('pedro son', 'pedro.son@gmail.com', '2011-02-21 18:32:40.505252', '2011-02-21 18:32:40.505252', 'ce3b5bb22e3330f705e92ba21ad95db1429ff039a93610cb77ce7899de87bad8', '25dfcea26b74e76529ef655e231eb3115b0fa18251e97a0d64b59135d2d83f1a') RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save