app/views/products/_form.html.erb

    <%= f.label :category %><br />
	<%= collection_select(:product, :category_id, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"