app/views/products/index.html.erb

SELECT "assets".* FROM "assets" WHERE ("assets".imageable_id = 1 AND "assets".imageable_type = 'Product')
---
	<td>
		<% product.assets.each do |asset| %>