app/views/layouts/_header.html.erb

			<ul id="secondary-menu" class="nav clearfix">
				<% Category.all.each do |cat| %>
---
SELECT "categories".* FROM "categories"